Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawRoofWall Property
 Can't make roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawRoofWall { get; }
Public Shared ReadOnly Property CannotDrawRoofWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawRoofWall {
	FailureDefinitionId^ get ();
}
static member CannotDrawRoofWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace